animal_app/app/controllers/sightings_controller.rb

    def index
        sightings = Sighting.all
---
SELECT "sightings".* FROM "sightings"

    def show
        view = Sighting.find(params[:id])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def date
        view = Sighting.where("date >= :start_date AND date <= :end_date",{start_date: params[:start_date], end_date: params[:end_date]})
---
SELECT "sightings".* FROM "sightings" WHERE (date >= '2015-12-08' AND date <= '2020-04-15')

    def create
        view = Sighting.create(view_params)
---
INSERT INTO "sightings" ("wildlife_id", "date", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        view = Sighting.find(params[:id])
        view.update(view_params)
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "sightings" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "sightings"."id" = $4  [["latitude", "122.8121 W"], ["longitude", "45.5842 N"], ["updated_at", "2020-08-05 22:45:19.463295"], ["id", 1]]

    def destroy
        view = Sighting.find(params[:id])
        if view.destroy
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 6]]